[
  {
    "id": "5537581321",
    "title": "Software Engineering Intern",
    "company": "Epistemix",
    "location": "Canada",
    "created": "2025-12-11T01:59:25Z",
    "category": "IT Jobs",
    "description": "Job Description Job Description We are seeking a skilled and dedicated intern to join our Engineering team. As a software engineering intern at Epistemix, you show a clear passion for quality and love to bring software to life. You are energized by the idea of building something new and want to work on problems that matter. In order to do this job well, you must be a curious and eager problem solver with a hunger for building well-designed, high-quality solutions. You have a passion for great w…",
    "skills": []
  },
  {
    "id": "5486880577",
    "title": "Software Engineering Intern",
    "company": "Trimble",
    "location": "Canada",
    "created": "2025-11-08T05:37:10Z",
    "category": "IT Jobs",
    "description": "Your Title: Software Engineering Intern Job Location: Richmond Hill, ON Our Department: Applanix Timing: 12-16 Months, Starting May 2026 About Trimble’s Internship Program As a Trimble intern, you will gain valuable hands-on experience, and be provided with challenging, meaningful tasks that will give you insight into what it's like working full-time as a valued member of a team. Our internships are designed to prepare you for your career journey while growing as a professional through lunch an…",
    "skills": []
  },
  {
    "id": "5382733556",
    "title": "Software Engineer, Intern",
    "company": "Stripe",
    "location": "Toronto, Ontario",
    "created": "2025-09-04T06:01:15Z",
    "category": "IT Jobs",
    "description": "Who we are About Stripe Stripe is a financial infrastructure platform for businesses. Millions of companies—from the world’s largest enterprises to the most ambitious startups—use Stripe to accept payments, grow their revenue, and accelerate new business opportunities. Our mission is to increase the GDP of the internet, and we have a staggering amount of work ahead. That means you have an unprecedented opportunity to put the global economy within everyone’s reach while doing the most important …",
    "skills": [
      "numpy",
      "typescript"
    ]
  },
  {
    "id": "5519632456",
    "title": "Software Engineering Intern",
    "company": "GPTZero",
    "location": "Canada",
    "created": "2025-11-29T14:07:40Z",
    "category": "IT Jobs",
    "description": "About GPTZero GPTZero is on a mission to restore trust and transparency on the internet. As the leading AI detection platform, we empower educators, students, journalists, marketers, and writers to navigate the evolving landscape of AI-generated content. With millions of users and institutions relying on us, we’re building a category-defining company at the intersection of AI and information integrity. Our team comes from high-performing engineering cultures, including Uber, Meta, Perplexity, A…",
    "skills": [
      "go",
      "rest",
      "rust",
      "spa",
      "typescript"
    ]
  },
  {
    "id": "5449211185",
    "title": "2026 - Software Engineering Intern, Toronto",
    "company": "MongoDB",
    "location": "Toronto, Ontario",
    "created": "2025-10-15T19:34:03Z",
    "category": "IT Jobs",
    "description": "We're seeking curious minds like yours to collaborate with full-time engineers and cross functional teammates, learn development standard methodologies, and gain practical software engineering experience. Software engineering interns are fully integrated into software engineering teams across our Product and Technology organization. Interns spend their summer pushing production-level code to make lasting contributions across MongoDB's products and services for our internal teams, external custo…",
    "skills": [
      "go",
      "mongodb",
      "typescript"
    ]
  },
  {
    "id": "5451825951",
    "title": "2026 - Software Engineering Intern, Toronto",
    "company": "MongoDB",
    "location": "Toronto, Ontario",
    "created": "2025-10-17T05:36:12Z",
    "category": "IT Jobs",
    "description": "We’re seeking curious minds like yours to collaborate with full-time engineers and cross functional teammates, learn development standard methodologies, and gain practical software engineering experience. Software engineering interns are fully integrated into software engineering teams across our Product and Technology organization. Interns spend their summer pushing production-level code to make lasting contributions across MongoDB’s products and services for our internal teams, external custo…",
    "skills": [
      "go",
      "mongodb",
      "typescript"
    ]
  },
  {
    "id": "5449936884",
    "title": "2026, Software Engineering Intern, Toronto",
    "company": "MDB General Referrals",
    "location": "Toronto, Ontario",
    "created": "2025-10-16T05:23:53Z",
    "category": "IT Jobs",
    "description": "We’re seeking curious minds like yours to collaborate with full-time engineers and cross functional teammates, learn development standard methodologies, and gain practical software engineering experience. Software engineering interns are fully integrated into software engineering teams across our Product and Technology organization. Interns spend their summer pushing production-level code to make lasting contributions across MongoDB’s products and services for our internal teams, external custo…",
    "skills": [
      "go",
      "mongodb",
      "typescript"
    ]
  },
  {
    "id": "5503766167",
    "title": "2026 Toronto Software Engineering Internship",
    "company": "The Trade Desk",
    "location": "Toronto, Ontario",
    "created": "2025-11-19T14:01:02Z",
    "category": "IT Jobs",
    "description": "The Trade Desk is a global technology company with a mission to create a better, more open internet for everyone through principled, intelligent advertising. Handling over 1 trillion queries per day, our platform operates at an unprecedented scale. We have also built something even stronger and more valuable: an award-winning culture based on trust, ownership, empathy, and collaboration. We value the unique experiences and perspectives that each person brings to The Trade Desk, and we are commi…",
    "skills": [
      "numpy",
      "rust"
    ]
  },
  {
    "id": "5393994708",
    "title": "Software Engineer Intern (Winter 2026)",
    "company": "Cohere",
    "location": "Canada",
    "created": "2025-09-11T06:06:52Z",
    "category": "IT Jobs",
    "description": "Who are we? Our mission is to scale intelligence to serve humanity. We’re training and deploying frontier models for developers and enterprises who are building AI systems to power magical experiences like content generation, semantic search, RAG, and agents. We believe that our work is instrumental to the widespread adoption of AI. We obsess over what we build. Each one of us is responsible for contributing to increasing the capabilities of our models and the value they drive for our customers…",
    "skills": [
      "typescript"
    ]
  },
  {
    "id": "5537276304",
    "title": "Backend Software Engineer Internship Winter 2026",
    "company": "DataVisor",
    "location": "Greater Vancouver, British Columbia",
    "created": "2025-12-10T21:14:53Z",
    "category": "IT Jobs",
    "description": "DataVisor is the world’s leading AI-powered Fraud and Risk Platform that delivers the best overall detection coverage in the industry. With an open SaaS platform that supports easy consolidation and enrichment of any data, DataVisor's solution scales infinitely and enables organizations to act on fast-evolving fraud and money laundering activities in real time. Its patented unsupervised machine learning technology, advanced device intelligence, powerful decision engine, and investigation tools …",
    "skills": [
      "typescript"
    ]
  },
  {
    "id": "5384649743",
    "title": "[Summer 2026 Canada] Software Engineer Intern",
    "company": "Roblox",
    "location": "Granville Island, Vancouver",
    "created": "2025-09-05T06:02:29Z",
    "category": "IT Jobs",
    "description": "As a Software Engineer Intern on our Rendering & Graphics team, you will be mentored by industry veterans from the video game and real-time simulation sectors. Over 12 weeks, we will provide you with a project tailored to your interests and our needs, focusing on your personal and professional development while you contribute to the core technology that powers millions of immersive experiences. You Will: Join our supportive Rendering & Graphics team, collaborating directly with and receiving me…",
    "skills": [
      "rest",
      "typescript"
    ]
  },
  {
    "id": "5436995928",
    "title": "Software Engineer, Intern (Summer 2026) - Toronto",
    "company": "DoorDash Canada",
    "location": "Toronto, Ontario",
    "created": "2025-10-08T05:20:12Z",
    "category": "IT Jobs",
    "description": "About the Team DoorDash is building the world’s most reliable on-demand logistics engine for delivery! We’re looking for experienced engineers to join our fast-growing engineering team to help us develop a 24x7 global infrastructure system that powers DoorDash’s three-sided marketplace of consumers, merchants, and dashers. About the Role At DoorDash, our product engineers implement and operate technological solutions to improve the experiences of our merchants, dashers, and consumers. From crea…",
    "skills": [
      "typescript"
    ]
  },
  {
    "id": "5383925655",
    "title": "Software Engineer Intern, 2026 Summer Canada",
    "company": "Atlassian",
    "location": "Canada",
    "created": "2025-09-04T17:43:33Z",
    "category": "IT Jobs",
    "description": "Working at Atlassian Atlassians can choose where they work – whether in an office, from home, or a combination of the two. That way, Atlassians have more control over supporting their family, personal goals, and other priorities. We can hire people in any country where we have a legal entity. Interviews and onboarding are conducted virtually, a part of being a distributed-first company. Your Future Org Atlassian’s Intern program combines hands-on technical training, professional growth opportun…",
    "skills": [
      "go"
    ]
  },
  {
    "id": "5525920212",
    "title": "Software Engineer Internship - iOS (Hybrid, Toronto)",
    "company": "OpenTable",
    "location": "Toronto, Ontario",
    "created": "2025-12-03T12:10:01Z",
    "category": "IT Jobs",
    "description": "* This role will be required to work from our downtown Toronto office 2 days a week. With millions of diners, 60,000 restaurant partners and 25 years of experience, OpenTable, part of Booking Holdings, Inc. (NASDAQ: BKNG), is an industry leader with a passion for helping restaurants thrive. Our world-class technology empowers restaurants to focus on what matters most – their team, their guests, and their bottom line – while enabling diners to discover and book the perfect restaurant for every o…",
    "skills": [
      "rest",
      "typescript"
    ]
  },
  {
    "id": "5539230292",
    "title": "Backend Software Engineer Internship Winter 2026",
    "company": "DataVisor",
    "location": "Canada",
    "created": "2025-12-12T02:06:52Z",
    "category": "IT Jobs",
    "description": "Job Description Job Description DataVisor is the world’s leading AI-powered Fraud and Risk Platform that delivers the best overall detection coverage in the industry. With an open SaaS platform that supports easy consolidation and enrichment of any data, DataVisor's solution scales infinitely and enables organizations to act on fast-evolving fraud and money laundering activities in real time. Its patented unsupervised machine learning technology, advanced device intelligence, powerful decision …",
    "skills": [
      "typescript"
    ]
  },
  {
    "id": "5414542168",
    "title": "Software Engineer Intern, Machine Learning (Summer 2026)",
    "company": "Lyft",
    "location": "Toronto, Ontario",
    "created": "2025-09-25T19:15:16Z",
    "category": "IT Jobs",
    "description": "At Lyft, our purpose is to serve and connect. We aim to achieve this by cultivating a work environment where all team members belong and have the opportunity to thrive. With over half a billion rides and counting, Lyft is solving hard problems in a flourishing domain with a lot of data and creative solutions in Marketplace, Mapping, Fraud, Growth and beyond. We're actively building the next-generation Machine Learning (ML) platform for low-cost, ultra-immersive transportation to improve people'…",
    "skills": []
  },
  {
    "id": "5486896515",
    "title": "Software Engineer Intern - Summer Session (Summer 2026)",
    "company": "NimbleRx",
    "location": "Toronto, Ontario",
    "created": "2025-11-08T05:48:36Z",
    "category": "IT Jobs",
    "description": "Nimble is a healthtech company on a mission to simplify access, understanding and management of healthcare. We are starting by building the largest, most loved pharmacy business in the world. We are a fast-growing, technology-first startup driven by perfecting the patient and pharmacist experience. Nimble fosters a culture of collaboration, open communication and deliberate action that allows us to face today’s most exciting challenges head-on and grow incredibly quickly. As a Nimble Engineer ,…",
    "skills": []
  },
  {
    "id": "5513547280",
    "title": "Software Engineer Intern Summer Term 2026 (Toronto)",
    "company": "Pinterest",
    "location": "Toronto, Ontario",
    "created": "2025-11-25T13:59:38Z",
    "category": "IT Jobs",
    "description": "About Pinterest Millions of people around the world come to our platform to find creative ideas, dream about new possibilities and plan for memories that will last a lifetime. At Pinterest, we’re on a mission to bring everyone the inspiration to create a life they love, and that starts with the people behind the product. Discover a career where you ignite innovation for millions, transform passion into growth opportunities, celebrate each other’s unique experiences and embrace the flexibility t…",
    "skills": [
      "rest",
      "typescript"
    ]
  },
  {
    "id": "5462311865",
    "title": "Software Engineer Intern - iOS, Poe (Canada - Remote)",
    "company": "Quora",
    "location": "Toronto, Ontario",
    "created": "2025-10-24T05:26:21Z",
    "category": "IT Jobs",
    "description": "[ Quora is a privately held, \"remote-first\" company . This position can be performed remotely from anywhere in Canada. Please visit careers.quora.com/eligible-countries for details regarding employment eligibility by country.] About Quora: Quora’s mission is to grow the world's collective intelligence. To do so, we have two platforms: Quora : a global knowledge sharing platform with over 300M monthly unique visitors, bringing people together to share insights on various topics and providing a u…",
    "skills": [
      "typescript"
    ]
  },
  {
    "id": "5538138825",
    "title": "Software Engineering Intern, Robotics Simulation - Summer 2026",
    "company": "NVIDIA",
    "location": "Toronto, Ontario",
    "created": "2025-12-11T14:07:53Z",
    "category": "IT Jobs",
    "description": "Today, NVIDIA is tapping into the unlimited potential of AI to define the next era of computing. An era in which our GPU acts as the brains of computers, robots, and self-driving cars that can understand the world. Doing what’s never been done before takes vision, innovation, and the world’s best talent. As an NVIDIAN, you’ll be immersed in a diverse, encouraging environment where everyone is inspired to do their best work. Come join the team and see how we can make a lasting impact on the worl…",
    "skills": [
      "typescript"
    ]
  },
  {
    "id": "5534609705",
    "title": "Software Engineer Intern (Winter 2026) 8-12 months",
    "company": "MASIV | Mercedes and Singh Innovative Ventures",
    "location": "Canada",
    "created": "2025-12-09T09:39:06Z",
    "category": "IT Jobs",
    "description": "MASIV | Software Engineering Intern | 8-12 months starting Winter 2026 | In-Person only www.mercedesandsingh.com | Calgary, AB | Canadian Citizens and PR holders only Pay starting at $23.50/hour  Performance Raises/Bonuses MASIV (est. 2016) is an Architectural Design, Fabrication, and Build company fusing design, technology, and construction to innovate multi-scale products and environments. We are Master Builders for the 21st century, rejecting the segregation of traditional disciplines to cre…",
    "skills": [
      "typescript"
    ]
  },
  {
    "id": "5538020411",
    "title": "Software Engineering Intern, Robot Learning Platform - Summer 2026",
    "company": "NVIDIA",
    "location": "Toronto, Ontario",
    "created": "2025-12-11T13:54:09Z",
    "category": "Engineering Jobs",
    "description": "Today, NVIDIA is tapping into the unlimited potential of AI to define the next era of computing. An era in which our GPU acts as the brains of computers, robots, and self-driving cars that can understand the world. Doing what’s never been done before takes vision, innovation, and the world’s best talent. As an NVIDIAN, you’ll be immersed in a diverse, encouraging environment where everyone is inspired to do their best work. Come join the team and see how we can make a lasting impact on the worl…",
    "skills": [
      "typescript"
    ]
  },
  {
    "id": "5515204772",
    "title": "Software Engineering Student Intern",
    "company": "Lincoln Electric",
    "location": "Waterloo, Waterloo region",
    "created": "2025-11-26T14:03:57Z",
    "category": "Engineering Jobs",
    "description": "Lincoln Electric is the world leader in the engineering, design, and manufacturing of advanced arc welding solutions, automated joining, assembly and cutting systems, plasma and oxy-fuel cutting equipment, and has a leading global position in brazing and soldering alloys. Lincoln is recognized as the Welding Expert for its leading materials science, software development, automation engineering, and application expertise, which advance customers' fabrication capabilities to help them build a bet…",
    "skills": [
      "typescript"
    ]
  },
  {
    "id": "5508237577",
    "title": "FY26 Intern - Telemetry and Tuning Software Engineering Internship - Canada (16 months)",
    "company": "Qualcomm",
    "location": "Markham, York region",
    "created": "2025-11-21T14:33:36Z",
    "category": "Engineering Jobs",
    "description": "Company Qualcomm Canada ULC Job Area Interns Group, Interns Group > Interim Engineering Intern - SW Qualcomm Overview Qualcomm is a company of inventors that unlocked 5G ushering in an age of rapid acceleration in connectivity and new possibilities that will transform industries, create jobs, and enrich lives. But this is just the beginning. It takes inventive minds with diverse skills, backgrounds, and cultures to transform 5Gs potential into world-changing technologies and products. This is t…",
    "skills": [
      "typescript"
    ]
  },
  {
    "id": "5528569746",
    "title": "Robotics - Software Development Engineer Intern - 2026 - Toronto",
    "company": "Amazon",
    "location": "Toronto, Ontario",
    "created": "2025-12-04T18:00:43Z",
    "category": "IT Jobs",
    "description": "Description Do you want to solve real customer problems through innovative technology? Do you enjoy working on scalable services in a collaborative team environment? Do you want to see your code directly impact millions of customers worldwide? At Amazon, we hire the best minds in technology to innovate and build on behalf of our customers. Customer obsession is part of our company DNA, which has made us one of the world's most beloved brands. Our Software Development Engineers (SDEs) use modern…",
    "skills": []
  },
  {
    "id": "5470265926",
    "title": "Software Development Engineer Internship - Summer 2026 (Canada)",
    "company": "Amazon",
    "location": "Greater Vancouver, British Columbia",
    "created": "2025-10-29T19:49:01Z",
    "category": "IT Jobs",
    "description": "Description By applying to this position, your application will only be considered for our summer Software Development Engineer (SDE) internship roles. Our summer intern roles have start dates in May/June 2026 and are 12 weeks in duration. Do you want to solve real customer problems through innovative technology? Do you enjoy working on scalable services in a collaborative team environment? Do you want to see your code directly impact millions of customers worldwide? At Amazon, we hire the best…",
    "skills": []
  },
  {
    "id": "5468747430",
    "title": "Software Development Engineer Internship - Summer 2026 (Canada)",
    "company": "Amazon Development Centre Canada ULC - K03",
    "location": "Vancouver, Greater Vancouver",
    "created": "2025-10-28T20:05:23Z",
    "category": "IT Jobs",
    "description": "By applying to this position, your application will only be considered for our summer Software Development Engineer (SDE) internship roles. Our summer intern roles have start dates in May/June 2026 and are 12 weeks in duration. Do you want to solve real customer problems through innovative technology? Do you enjoy working on scalable services in a collaborative team environment? Do you want to see your code directly impact millions of customers worldwide? At Amazon, we hire the best minds in te…",
    "skills": []
  },
  {
    "id": "5526736110",
    "title": "Robotics - Software Development Engineer Intern - 2026 - Toronto",
    "company": "Amazon Development Centre Canada ULC - K03",
    "location": "Toronto, Ontario",
    "created": "2025-12-03T18:21:27Z",
    "category": "IT Jobs",
    "description": "Do you want to solve real customer problems through innovative technology? Do you enjoy working on scalable services in a collaborative team environment? Do you want to see your code directly impact millions of customers worldwide? At Amazon, we hire the best minds in technology to innovate and build on behalf of our customers. Customer obsession is part of our company DNA, which has made us one of the world's most beloved brands. Our Software Development Engineers (SDEs) use modern technology …",
    "skills": []
  },
  {
    "id": "5529791644",
    "title": "Robotics - Software Development Engineer Intern - 2026 - Toronto",
    "company": "Amazon",
    "location": "Toronto, Ontario",
    "created": "2025-12-05T14:27:56Z",
    "category": "IT Jobs",
    "description": "Description Do you want to solve real customer problems through innovative technology? Do you enjoy working on scalable services in a collaborative team environment? Do you want to see your code directly impact millions of customers worldwide? At Amazon, we hire the best minds in technology to innovate and build on behalf of our customers. Customer obsession is part of our company DNA, which has made us one of the world's most beloved brands. Our Software Development Engineers (SDEs) use modern…",
    "skills": []
  },
  {
    "id": "5531339401",
    "title": "Robotics - Software Development Engineer Intern - 2026 - Toronto",
    "company": "Amazon",
    "location": "Toronto, Ontario",
    "created": "2025-12-06T12:37:50Z",
    "category": "IT Jobs",
    "description": "Do you want to solve real customer problems through innovative technology? Do you enjoy working on scalable services in a collaborative team environment? Do you want to see your code directly impact millions of customers worldwide? At Amazon, we hire the best minds in technology to innovate and build on behalf of our customers. Customer obsession is part of our company DNA, which has made us one of the world's most beloved brands. Our Software Development Engineers (SDEs) use modern technology …",
    "skills": []
  },
  {
    "id": "5477969099",
    "title": "Software Development Engineer Internship - Summer 2026 (Canada)",
    "company": "Amazon",
    "location": "Greater Vancouver, British Columbia",
    "created": "2025-11-03T04:33:11Z",
    "category": "IT Jobs",
    "description": "By applying to this position, your application will only be considered for our summer Software Development Engineer (SDE) internship roles. Our summer intern roles have start dates in May/June 2026 and are 12 weeks in duration. Do you want to solve real customer problems through innovative technology? Do you enjoy working on scalable services in a collaborative team environment? Do you want to see your code directly impact millions of customers worldwide? At Amazon, we hire the best minds in te…",
    "skills": []
  },
  {
    "id": "5492613886",
    "title": "Intern, Software Engineering",
    "company": "Mastercard",
    "location": "Toronto, Ontario",
    "created": "2025-11-12T14:06:17Z",
    "category": "IT Jobs",
    "description": "Our Purpose _Mastercard powers economies and empowers people in 200 countries and territories worldwide. Together with our customers, we're helping build a sustainable economy where everyone can prosper. We support a wide range of digital payments choices, making transactions secure, simple, smart and accessible. Our technology and innovation, partnerships and networks combine to deliver a unique set of products and services that help people, businesses and governments realize their greatest po…",
    "skills": [
      "go",
      "typescript"
    ]
  },
  {
    "id": "5536443917",
    "title": "Software Engineer Co-op/Intern",
    "company": "Nokia Global",
    "location": "Canada",
    "created": "2025-12-10T13:39:59Z",
    "category": "IT Jobs",
    "description": "Description Position: Software Engineer Co-op/Intern Number of Position(s): 1 Duration: 4 Months Date: May to August, 2026 Location: Hybrid in Ottawa EDUCATIONAL RECOMMENDATIONS Currently a candidate for a Master’s, bachelor's degree or Diploma in Computer Science, Computer Systems Engineering, Software Engineering or a related field with an accredited school in Canada. Responsibilities As part of our team, you will: Collaborate with software designers and testers to refine requirements, develo…",
    "skills": [
      "typescript"
    ]
  },
  {
    "id": "5536485775",
    "title": "Software Engineer Co-op/Intern",
    "company": "Nokia",
    "location": "Kanata, Ottawa region",
    "created": "2025-12-10T13:44:37Z",
    "category": "IT Jobs",
    "description": "Job Description Position: Software Engineer Co-op/Intern Number of Position(s): 1 Duration: 4 Months Date: May to August, 2026 Location: Hybrid in Ottawa EDUCATIONAL RECOMMENDATIONS Currently a candidate for a Master’s, bachelor's degree or Diploma in Computer Science, Computer Systems Engineering, Software Engineering or a related field with an accredited school in Canada. How You Will Contribute And What You Will Learn As part of our team, you will: Collaborate with software designers and tes…",
    "skills": []
  },
  {
    "id": "5529384010",
    "title": "Software Engineering, Metal Runtime Intern/PEY",
    "company": "Tenstorrent University Jobs",
    "location": "Toronto, Ontario",
    "created": "2025-12-05T12:15:23Z",
    "category": "IT Jobs",
    "description": "Tenstorrent is leading the industry on cutting-edge AI technology, revolutionizing performance expectations, ease of use, and cost efficiency. With AI redefining the computing paradigm, solutions must evolve to unify innovations in software models, compilers, platforms, networking, and semiconductors. Our diverse team of technologists have developed a high performance RISC-V CPU from scratch, and share a passion for AI and a deep desire to build the best AI platform possible. We value collabora…",
    "skills": [
      "typescript"
    ]
  },
  {
    "id": "5499393701",
    "title": "Embedded Software Engineer Co-op/Intern",
    "company": "Lumentum",
    "location": "Canada",
    "created": "2025-11-16T11:51:34Z",
    "category": "Engineering Jobs",
    "description": "It's fun to work in a company where people truly BELIEVE in what they're doing! We're committed to bringing passion and customer focus to the business. If you like wild growth and working with happy, enthusiastic over-achievers, you'll enjoy your career with us! Lumentum Canada was awarded the 2022 National Capital Region’s Top Employers for the 6th consecutive year and the 2022 Career Directory Canada’s Best Employers for Recent Graduates for the 5th consecutive year . Position Title: Embedded…",
    "skills": [
      "python"
    ]
  },
  {
    "id": "5526721696",
    "title": "TD Talent Connect - University of Toronto (January 15 & 16, 2026) - Co-op/Intern Applicants",
    "company": "TD Bank",
    "location": "Toronto, Ontario",
    "created": "2025-12-03T18:10:48Z",
    "category": "IT Jobs",
    "description": "Role Type: Internship/Co-op Work Term: Summer/Term 3 Work Location: Toronto, Ontario, Canada Hours: 37.5 Pay Details: $45,700 - $74,400 CAD TD is committed to providing fair and equitable compensation opportunities to all colleagues. Growth opportunities and skill development are defining features of the colleague experience at TD. Our compensation policies and practices have been designed to allow colleagues to progress through the salary range over time as they progress in their role. The bas…",
    "skills": []
  },
  {
    "id": "5527984948",
    "title": "TD Talent Connect - University of Toronto (January 15 & 16, 2026) - Co-op/Intern Applicants",
    "company": "TD Securities",
    "location": "Toronto, Ontario",
    "created": "2025-12-04T13:49:25Z",
    "category": "IT Jobs",
    "description": "Role Type: Internship/Co-op Work Term: Summer/Term 3 Work Location: Toronto, Ontario, Canada Hours: 37.5 Pay Details: $45,700 - $74,400 CAD TD is committed to providing fair and equitable compensation opportunities to all colleagues. Growth opportunities and skill development are defining features of the colleague experience at TD. Our compensation policies and practices have been designed to allow colleagues to progress through the salary range over time as they progress in their role. The bas…",
    "skills": []
  },
  {
    "id": "5492599281",
    "title": "Software Engineer, Summer 2026 - Vancouver, Canada",
    "company": "Mastercard",
    "location": "Greater Vancouver, British Columbia",
    "created": "2025-11-12T13:43:33Z",
    "category": "IT Jobs",
    "description": "Our Purpose _Mastercard powers economies and empowers people in 200 countries and territories worldwide. Together with our customers, we're helping build a sustainable economy where everyone can prosper. We support a wide range of digital payments choices, making transactions secure, simple, smart and accessible. Our technology and innovation, partnerships and networks combine to deliver a unique set of products and services that help people, businesses and governments realize their greatest po…",
    "skills": [
      "go",
      "typescript"
    ]
  },
  {
    "id": "5436995264",
    "title": "Software Engineer I, Entry-Level (Graduation Date: Fall 2025-Summer 2026)",
    "company": "DoorDash Canada",
    "location": "Toronto, Ontario",
    "created": "2025-10-08T05:19:31Z",
    "category": "IT Jobs",
    "description": "About the Team DoorDash is building the world’s most reliable on-demand logistics engine for delivery! We’re looking for experienced engineers to join our fast-growing engineering team to help us develop a 24x7 global infrastructure system that powers DoorDash’s three-sided marketplace of consumers, merchants, and dashers. About the Role We are looking for highly motivated college students looking for post-graduation work opportunities to start their career at DoorDash! Our product engineers im…",
    "skills": [
      "typescript"
    ]
  },
  {
    "id": "5511693266",
    "title": "Intern Research Engineer - Software Systems Engineering/LLMs",
    "company": "Huawei Technologies Canada Co., Ltd.",
    "location": "Unionville, York region",
    "created": "2025-11-24T15:14:50Z",
    "category": "IT Jobs",
    "description": "Huawei Canada has an immediate internship opening for a Research Engineer. About the team: The Intelligent Testing Technology Team, currently a part of the Waterloo Research Centre, is at the forefront of integrating large language models (LLMs) with formal methods to advance artificial intelligence. By harnessing LLMs' strengths in natural language processing and generation, this team explores their synergy with the precision of formal verification techniques. As part of this team, you will co…",
    "skills": []
  },
  {
    "id": "5497442721",
    "title": "Software Engineer, Entry-Level",
    "company": "DoorDash Canada",
    "location": "Toronto, Ontario",
    "created": "2025-11-15T11:52:33Z",
    "category": "IT Jobs",
    "description": "About the Team DoorDash is building the world’s most reliable on-demand logistics engine for delivery! We’re looking for experienced engineers to join our fast-growing engineering team to help us develop a 24x7 global infrastructure system that powers DoorDash’s three-sided marketplace of consumers, merchants, and dashers. About the Role Our product engineers implement and operate technological solutions to improve the experiences of our merchants, dashers, and consumers. From creating beautifu…",
    "skills": [
      "typescript"
    ]
  },
  {
    "id": "5462324481",
    "title": "Machine Learning Engineer Intern - Poe (Canada - Remote)",
    "company": "Quora",
    "location": "Toronto, Ontario",
    "created": "2025-10-24T05:33:42Z",
    "category": "IT Jobs",
    "description": "[ Quora is a privately held, \"remote-first\" company . This position can be performed remotely from anywhere in Canada. Please visit careers.quora.com/eligible-countries for details regarding employment eligibility by country.] About Quora: Quora’s mission is to grow the world's collective intelligence. To do so, we have two platforms: Quora : a global knowledge sharing platform with over 300M monthly unique visitors, bringing people together to share insights on various topics and providing a u…",
    "skills": [
      "typescript"
    ]
  },
  {
    "id": "5474663898",
    "title": "AI Engineer Intern - Poe (Canada - Remote)",
    "company": "Quora",
    "location": "Toronto, Ontario",
    "created": "2025-11-01T05:47:50Z",
    "category": "IT Jobs",
    "description": "[ Quora is a privately held, \"remote-first\" company . This position can be performed remotely from anywhere in Canada. Please visit careers.quora.com/eligible-countries for details regarding employment eligibility by country.] About Quora: Quora’s mission is to grow the world's collective intelligence. To do so, we have two platforms: Quora : a global knowledge sharing platform with over 300M monthly unique visitors, bringing people together to share insights on various topics and providing a u…",
    "skills": [
      "typescript"
    ]
  },
  {
    "id": "5476803934",
    "title": "2026 - Education Engineering Intern, Toronto",
    "company": "MongoDB",
    "location": "Toronto, Ontario",
    "created": "2025-11-02T04:34:26Z",
    "category": "IT Jobs",
    "description": "The Education Engineering department is responsible for platforms and AI tools that power MongoDB learning worldwide, including the documentation platform, MongoDB University, and the MongoDB AI Assistant. We’re seeking curious minds like yours to collaborate with full-time engineers and cross functional teammates, deepen your software development knowledge, and gain professional coding experience. Software Engineering Interns within the Education engineering department are fully integrated sof…",
    "skills": [
      "go",
      "mongodb"
    ]
  },
  {
    "id": "5473588660",
    "title": "2026 - Education Engineering Intern, Toronto",
    "company": "MongoDB",
    "location": "Toronto, Ontario",
    "created": "2025-10-31T19:40:34Z",
    "category": "IT Jobs",
    "description": "The Education Engineering department is responsible for platforms and AI tools that power MongoDB learning worldwide, including the documentation platform, MongoDB University, and the MongoDB AI Assistant. We're seeking curious minds like yours to collaborate with full-time engineers and cross functional teammates, deepen your software development knowledge, and gain professional coding experience. Software Engineering Interns within the Education engineering department are fully integrated sof…",
    "skills": [
      "go",
      "mongodb"
    ]
  },
  {
    "id": "5539889074",
    "title": "Engineering Graduate Program",
    "company": "EQ Bank",
    "location": "Toronto, Ontario",
    "created": "2025-12-12T13:55:22Z",
    "category": "Graduate Jobs",
    "description": "Join a Challenger Being a traditional bank just isn’t our thing, so we challenge ourselves to get creative in providing innovative banking solutions for Canadians. How do we get there? With a talented team of inquisitive and agile challengers that break through the status quo. So, if you’re passionate about redefining the future of banking—while having fun—this could be your next big opportunity. Our company continues to grow, and today we serve more than 670,000 people across Canada through Eq…",
    "skills": []
  },
  {
    "id": "5531280368",
    "title": "Cyber Security Dome Test Eng Student",
    "company": "Nokia Global",
    "location": "Canada",
    "created": "2025-12-06T12:34:48Z",
    "category": "IT Jobs",
    "description": "Description Position: Cyber Security Dome Test Eng Student Number of Position(s): 1 Duration: 4 Months Date: May to August 2026 Location: Hybrid in Ottawa, Canada EDUCATIONAL RECOMMENDATIONS Currently a candidate for a Master’s, Bachelor's degree or Diploma in Computer Science or a related field, with an accredited school in Canada. Responsibilities As a part of our team, you will: Work with a team of software engineers and/or other interns/coops developing application software and services tha…",
    "skills": []
  },
  {
    "id": "5532436812",
    "title": "Autonomous Network Fabric Eng Student",
    "company": "Nokia Global",
    "location": "Canada",
    "created": "2025-12-07T12:14:19Z",
    "category": "IT Jobs",
    "description": "Description Position: Autonomous Network Fabric Eng Student Number of Position(s): 5 Duration : 4 Months Date: May to August 2026 Location: Hybrid in Ottawa, Canada EDUCATIONAL RECOMMENDATIONS Currently a candidate for a Master’s, Bachelor's degree or Diploma in Computer Science or a related field, with an accredited school in Canada. Responsibilities As a part of our team, you will: Work with a team of software engineers and/or other interns/coops developing application software and services t…",
    "skills": []
  },
  {
    "id": "5414221323",
    "title": "Software Developer Intern, Backend (Summer 2026)",
    "company": "Robinhood",
    "location": "Toronto, Ontario",
    "created": "2025-09-25T05:44:16Z",
    "category": "IT Jobs",
    "description": "Join us in building the future of finance. Our mission is to democratize finance for all. An estimated $124 trillion of assets will be inherited by younger generations in the next two decades. The largest transfer of wealth in human history. If you’re ready to be at the epicenter of this historic cultural and financial shift, keep reading. About the team  role We are building an elite team, applying frontier technologies to the world’s biggest financial problems. We’re looking for bold thinkers…",
    "skills": [
      "typescript"
    ]
  }
]